Revit 2027 API
View.ViewPositionId Property
 The id of the view's saved position. Default is set to ElementId.InvalidElementId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ViewPositionId { get; set; }
Public Property ViewPositionId As ElementId
	Get
	Set
public:
property ElementId^ ViewPositionId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ViewPositionId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property:
See Also
Reference
View Class
Autodesk.Revit.DB Namespace